In [1]:
## data cleaning of initial datasets

In [2]:
import pandas as pd

In [ ]:
## price table

In [44]:
airbnb_price = pd.read_csv("~/Downloads/airbnb_data/airbnb_price.csv")

In [45]:
airbnb_price.columns

Index(['listing_id', 'price', 'nbhood_full'], dtype='object')

In [46]:
airbnb_price.sample(5) #can also do .sample(frac = 0.1)

       listing_id       price                 nbhood_full
3498      4958223  99 dollars  Manhattan, Upper West Side
14257    24983373  40 dollars             Queens, Jamaica
17014    28667969  80 dollars          Brooklyn, Canarsie
7111     13770680  50 dollars            Queens, Flushing
22621    33808634  31 dollars       Brooklyn, Fort Greene

In [47]:
airbnb_price.head() #alternative to above

   listing_id        price                nbhood_full
0        2595  225 dollars         Manhattan, Midtown
1        3831   89 dollars     Brooklyn, Clinton Hill
2        5099  200 dollars     Manhattan, Murray Hill
3        5178   79 dollars  Manhattan, Hell's Kitchen
4        5238  150 dollars       Manhattan, Chinatown

In [48]:
## splitting the nbhood column into 2 separate columns and replacing it

In [49]:
airbnb_price[['borough', 'neighbourhood']] = airbnb_price['nbhood_full'].str.split(', ', 1, expand=True)

C:\Users\user\AppData\Local\Temp\ipykernel_18700\3896133075.py:1: FutureWarning: In a future version of pandas all arguments of StringMethods.split except for the argument 'pat' will be keyword-only.
  airbnb_price[['borough', 'neighbourhood']] = airbnb_price['nbhood_full'].str.split(', ', 1, expand=True)

In [50]:
airbnb_price.drop('nbhood_full', axis = 1, inplace = True)

In [51]:
airbnb_price.head()

   listing_id        price    borough   neighbourhood
0        2595  225 dollars  Manhattan         Midtown
1        3831   89 dollars   Brooklyn    Clinton Hill
2        5099  200 dollars  Manhattan     Murray Hill
3        5178   79 dollars  Manhattan  Hell's Kitchen
4        5238  150 dollars  Manhattan       Chinatown

In [52]:
airbnb_price.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   listing_id     25209 non-null  int64
 1   price          25209 non-null  object
 2   borough        25209 non-null  object
 3   neighbourhood  25209 non-null  object
dtypes: int64(1), object(3)
memory usage: 787.9+ KB

In [53]:
airbnb_price.shape

(25209, 4)

In [ ]:
## identifying columns with nulls

In [54]:
airbnb_price_isnull = airbnb_price.isnull().sum()

In [55]:
airbnb_price_isnull

listing_id       0
price            0
borough          0
neighbourhood    0
dtype: int64

In [ ]:
## review table

In [15]:
airbnb_last_review = pd.read_csv("~/Downloads/airbnb_data/airbnb_last_review.tsv", sep="\t")

In [16]:
airbnb_last_review.columns

Index(['listing_id', 'host_name', 'last_review'], dtype='object')

In [17]:
#airbnb_last_review.drop('host_name', axis = 1, inplace = True)

In [18]:
airbnb_last_review.sample(5)

       listing_id host_name   last_review
12318    22037715    Adeola  June 17 2019
7537     14588464     Maria  July 06 2019
6439     12358117      Doug  July 02 2019
1418      1112070    Autumn  June 30 2019
23208    34285612     Fanny  June 25 2019

In [19]:
airbnb_last_review.head()

   listing_id    host_name   last_review
0        2595     Jennifer   May 21 2019
1        3831  LisaRoxanne  July 05 2019
2        5099        Chris  June 22 2019
3        5178     Shunichi  June 24 2019
4        5238          Ben  June 09 2019

In [20]:
airbnb_last_review.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   host_name    25201 non-null  object
 2   last_review  25209 non-null  object
dtypes: int64(1), object(2)
memory usage: 591.0+ KB

In [ ]:
## changing date object to datetime in MM/DD/YY format

In [56]:
 airbnb_last_review['last_review'] = pd.to_datetime(airbnb_last_review['last_review'])

In [58]:
airbnb_last_review['last_review'] = airbnb_last_review['last_review'].dt.strftime('%m/%d/%Y')

In [59]:
airbnb_last_review.head()

   listing_id    host_name last_review
0        2595     Jennifer  05/21/2019
1        3831  LisaRoxanne  07/05/2019
2        5099        Chris  06/22/2019
3        5178     Shunichi  06/24/2019
4        5238          Ben  06/09/2019

In [60]:
airbnb_last_review.shape

(25209, 3)

In [ ]:
## identifying and dropping columns with nulls

In [61]:
airbnb_last_review_isnull = airbnb_last_review.isnull().sum()

In [62]:
airbnb_last_review_isnull

listing_id     0
host_name      8
last_review    0
dtype: int64

In [63]:
airbnb_last_review_nulls = airbnb_last_review_isnull[airbnb_last_review_isnull > 0]

In [64]:
airbnb_last_review_nulls

host_name    8
dtype: int64

In [65]:
airbnb_last_review_no_nulls = airbnb_last_review.dropna(axis=1)

In [66]:
airbnb_last_review_no_nulls.head()

   listing_id last_review
0        2595  05/21/2019
1        3831  07/05/2019
2        5099  06/22/2019
3        5178  06/24/2019
4        5238  06/09/2019

In [ ]:
## room type table

In [33]:
airbnb_room_type = pd.read_excel("~/Downloads/airbnb_data/airbnb_room_type.xlsx")

In [34]:
airbnb_room_type.head()

   listing_id                                description        room_type
0        2595                      Skylit Midtown Castle  Entire home/apt
1        3831            Cozy Entire Floor of Brownstone  Entire home/apt
2        5099  Large Cozy 1 BR Apartment In Midtown East  Entire home/apt
3        5178            Large Furnished Room Near B'way     private room
4        5238         Cute & Cozy Lower East Side 1 bdrm  Entire home/apt

In [35]:
airbnb_room_type.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   description  25199 non-null  object
 2   room_type    25209 non-null  object
dtypes: int64(1), object(2)
memory usage: 591.0+ KB

In [36]:
airbnb_room_type.shape

(25209, 3)

In [ ]:
## identifying and dropping columns with nulls

In [37]:
airbnb_room_type.isnull = airbnb_room_type.isnull().sum()

In [38]:
airbnb_room_type.isnull

listing_id      0
description    10
room_type       0
dtype: int64

In [39]:
airbnb_room_type_nulls = airbnb_room_type.isnull[airbnb_room_type.isnull > 0]

In [40]:
airbnb_room_type_nulls

description    10
dtype: int64

In [41]:
airbnb_room_type_no_nulls = airbnb_room_type.dropna(axis=1)

In [42]:
airbnb_room_type_no_nulls.head()

   listing_id        room_type
0        2595  Entire home/apt
1        3831  Entire home/apt
2        5099  Entire home/apt
3        5178     private room
4        5238  Entire home/apt